[
    {
        "categoryId": 1,
        "subCategoryId": 1,
        "toyName": "Electronic Snap Circuits Kit",
        "toyImage": "electronic_snap_circuits.jpg",
        "toyPrice": 49.99,
        "toyRating": 4.6,
        "toyDescription": "Ignite your curiosity with the Electronic Snap Circuits Kit. This comprehensive kit allows you to build exciting electronic circuits without any soldering. With snap-together components and a detailed manual, you can create over 100 projects. Explore concepts like resistors, capacitors, and switches as you build alarms, radios, and more. The kit provides a hands-on learning experience that sparks your interest in electronics. Discover the joy of circuitry and unleash your creativity with the Electronic Snap Circuits Kit. Get ready to be amazed as you bring your creations to life!"
    },
    {
        "categoryId": 1,
        "subCategoryId": 1,
        "toyName": "Digital Music Maker",
        "toyImage": "digital_music_maker.jpg",
        "toyPrice": 24.99,
        "toyRating": 4.4,
        "toyDescription": "Compose your own melodies and dive into the world of music with the Digital Music Maker. This compact and portable device allows you to create, record, and play back your tunes. Experiment with different sounds, rhythms, and instruments to express your creativity. With a user-friendly interface and various built-in effects, you can produce professional-quality music right at your fingertips. Whether you're a beginner or an aspiring musician, the Digital Music Maker offers endless possibilities for exploration and self-expression. Unleash your musical talents and let your imagination soar with this innovative music-making tool!"
    },
    {
        "categoryId": 1,
        "subCategoryId": 1,
        "toyName": "Electronic Experiment Lab",
        "toyImage": "electronic_experiment_lab.jpg",
        "toyPrice": 34.99,
        "toyRating": 4.7,
        "toyDescription": "Step into the world of electronic experimentation with the Electronic Experiment Lab. This comprehensive kit is packed with exciting components and experiments that introduce you to the fascinating world of electronics. From building basic circuits to exploring advanced concepts, you'll gain hands-on experience with resistors, capacitors, transistors, and more. The kit comes with a detailed manual that guides you through each experiment, explaining the underlying principles along the way. Get ready to conduct your own scientific investigations and unlock the mysteries of electricity. Ignite your passion for electronics with the Electronic Experiment Lab!"
    },
    {
        "categoryId": 1,
        "subCategoryId": 1,
        "toyName": "Electronic Circuit Builder Kit",
        "toyImage": "electronic_circuit_builder.jpg",
        "toyPrice": 39.99,
        "toyRating": 4.5,
        "toyDescription": "Build and experiment with electronic circuits using this comprehensive kit. It provides a hands-on learning experience for both beginners and advanced users. With various components like resistors, capacitors, and LEDs, you can explore circuitry, electrical concepts, and even create your own unique designs. The kit comes with a detailed instruction manual that guides you through exciting projects and helps you understand the principles behind circuit building. Get ready to dive into the fascinating world of electronics with this fantastic Electronic Circuit Builder Kit!"
    },
    {
        "categoryId": 1,
        "subCategoryId": 1,
        "toyName": "Robotics Coding Kit",
        "toyImage": "robotics_coding_kit.jpg",
        "toyPrice": 59.99,
        "toyRating": 4.8,
        "toyDescription": "Embark on an exciting coding and robotics journey with this advanced Robotics Coding Kit. Designed to unleash your creativity, it combines the power of programming and robotics. The kit includes a programmable robot, sensors, and a user-friendly coding software interface. With step-by-step tutorials and hands-on projects, you'll learn to design and program your own robotic creations. Explore concepts like sensors, motors, and artificial intelligence, and watch as your robots come to life. Dive into the fascinating world of robotics and coding with this cutting-edge kit, and let your imagination soar!"
    },
    {
        "categoryId": 1,
        "subCategoryId": 1,
        "toyName": "DIY Solar Power Electronics Kit",
        "toyImage": "diy_solar_power_kit.jpg",
        "toyPrice": 29.99,
        "toyRating": 4.3,
        "toyDescription": "Unleash the power of the sun with this amazing DIY Solar Power Electronics Kit. With this comprehensive kit, you'll learn about renewable energy and build your own solar-powered devices. From solar panels to rechargeable batteries, this kit has everything you need to create exciting projects like solar-powered cars, fans, and more. The detailed instruction manual guides you through each step, explaining the science behind solar energy. Explore the potential of sustainable power and discover how the sun can be harnessed to generate electricity. Start your eco-friendly journey with this educational and engaging DIY Solar Power Electronics Kit!"
    }
]