[
    {
      "categoryId": 1,
      "subCategoryId": 2,
      "toyName": "Robotic Arm Kit",
      "toyImage": "robotic_arm_kit.jpg",
      "toyPrice": 49.99,
      "toyRating": 4.5,
      "toyDescription": "Experience the power of robotics with this Robotic Arm Kit. Build your own fully functional robotic arm and learn about robotics principles such as kinematics and control systems. The kit includes motors, sensors, and a programmable controller, allowing you to command the robot to perform various tasks. Explore the world of automation and engineering as you assemble and program your robot. Let your creativity and problem-solving skills shine through as you delve into the exciting field of robotics!"
    },
    {
      "categoryId": 1,
      "subCategoryId": 2,
      "toyName": "Coding Robot",
      "toyImage": "coding_robot.jpg",
      "toyPrice": 59.99,
      "toyRating": 4.8,
      "toyDescription": "Unleash your coding skills with this advanced Coding Robot. Designed to introduce programming concepts, this robot allows you to create your own commands and watch it execute them. With an intuitive coding interface, you can program the robot to move, dance, and interact with its environment. Learn about algorithms, loops, and conditional statements as you develop your coding expertise. Challenge yourself with exciting coding projects and witness the power of robotics and programming come to life!"
    },
    {
      "categoryId": 1,
      "subCategoryId": 2,
      "toyName": "Robotic Exploration Rover",
      "toyImage": "robotic_exploration_rover.jpg",
      "toyPrice": 79.99,
      "toyRating": 4.3,
      "toyDescription": "Embark on a thrilling journey of exploration with the Robotic Exploration Rover. This remote-controlled robot is equipped with sensors and a sturdy design that can traverse challenging terrains. Discover the wonders of robotics and space exploration as you navigate your rover through obstacles and collect scientific data. With an intuitive control interface, you'll feel like a real space explorer. Experience the excitement of robotics and ignite your curiosity about the mysteries of the universe!"
    },
    
        {
          "categoryId": 1,
          "subCategoryId": 2,
          "toyName": "Robotic Soccer Set",
          "toyImage": "robotic_soccer_set.jpg",
          "toyPrice": 69.99,
          "toyRating": 4.7,
          "toyDescription": "Experience the thrill of robotic soccer with this exciting Robotic Soccer Set. Compete against friends or program your robots to play autonomously. The set includes two robot players, a ball, and a soccer field. Use the remote control or develop your coding skills to strategize, score goals, and defend your net. Discover the world of robotics, teamwork, and sportsmanship as you engage in exciting matches and improve your robotic soccer skills!"
        },
        {
          "categoryId": 1,
          "subCategoryId": 2,
          "toyName": "Robotic Pet Companion",
          "toyImage": "robotic_pet_companion.jpg",
          "toyPrice": 89.99,
          "toyRating": 4.6,
          "toyDescription": "Introducing your new Robotic Pet Companion! This adorable robot is designed to provide companionship and interact with you. It responds to touch, performs tricks, and even recognizes your voice. With built-in sensors, it can navigate your home, avoiding obstacles along the way. Customize its behavior and train it to respond to commands. Experience the joy of having a robotic pet that brings entertainment and companionship into your life!"
        },
        {
          "categoryId": 1,
          "subCategoryId": 2,
          "toyName": "DIY Robotic Kit",
          "toyImage": "diy_robotic_kit.jpg",
          "toyPrice": 39.99,
          "toyRating": 4.4,
          "toyDescription": "Unleash your creativity with this DIY Robotic Kit. This kit allows you to build and customize your own robot using various electronic components. With step-by-step instructions, you'll learn about robotics principles and develop your technical skills. Experiment with different sensors and programming techniques to make your robot navigate, avoid obstacles, and perform tasks. Let your imagination run wild as you create your unique robotic companion!"
        }
      
      
  ]
  